/*
 * pidtrack - the statistics of a process
 *
 * Copyright (C) 2020 Weiping Zhang <zwp10758@gmail.com>
 *
 * The license below covers all files distributed with cputil unless otherwise
 * noted in the file itself.
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License version 2 as
 *  published by the Free Software Foundation.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, see <https://www.gnu.org/licenses/>.
 *
 */

#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <stdint.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <string.h>
#include <errno.h>
#include <time.h>
#include <dirent.h>
#include <sys/prctl.h>
#include <sys/socket.h>
#include <linux/taskstats.h>
#include <linux/genetlink.h>
#include "list.h"

#define VERSION "v1.3.4"

LIST_HEAD(g_list);
LIST_HEAD(g_list_cgroup);

/*
 * Generic macros for dealing with netlink sockets. Might be duplicated
 * elsewhere. It is recommended that commercial grade applications use
 * libnl or libnetlink and use the interfaces provided by the library
 */
#define GENLMSG_DATA(glh)       ((void *)(NLMSG_DATA(glh) + GENL_HDRLEN))
#define GENLMSG_PAYLOAD(glh)    (NLMSG_PAYLOAD(glh, 0) - GENL_HDRLEN)
#define NLA_DATA(na)            ((void *)((char*)(na) + NLA_HDRLEN))
#define NLA_PAYLOAD(len)        (len - NLA_HDRLEN)


/* Maximum size of response requested or message sent */
#define MAX_MSG_SIZE    2048

struct msgtemplate {
	struct nlmsghdr n;
	union {
		struct genlmsghdr g;
		struct nlmsgerr e;
	};
	char buf[MAX_MSG_SIZE];
};

struct cgroup {
	struct list_head node;
	char path[PATH_MAX];
};

#define PID_STAT_NR 42
struct pid_stat {
/*01 */	int pid;
/*02 */	char comm[17];
/*03 */	char state;
/*04 */	int ppid;
/*05 */	int pgrp;
/*06 */	int session;
/*07 */	int tty_nr;
/*08 */	int tpgid;
/*09 */	unsigned int flags;
/*10 */	unsigned long minflt;
/*11 */	unsigned long cminflt;
/*12 */	unsigned long majflt;
/*13 */	unsigned long cmajflt;
/*14 */	unsigned long  utime;
/*15 */	unsigned long  stime;
/*16 */ long cutime;
/*17 */	long cstime;
/*18 */	long priority;
/*19 */	long nice;
/*20 */	long num_threads;
/*21 */	long itrealvalue;
/*22 */ unsigned long long starttine;
/*23 */ unsigned long vsize;
/*24 */ long rss;
/*25 */ unsigned long rsslim;
/*26 */ unsigned long startcode;
/*27 */ unsigned long endcode;
/*28 */ unsigned long startstack;
/*29 */ unsigned long kstkesp;
/*30 */ unsigned long kstkeip;
/*31 */ unsigned long signal;
/*32 */ unsigned long blocked;
/*33 */ unsigned long sinignore;
/*34 */ unsigned long sigcatch;
/*35 */ unsigned long wchan;
/*36 */ unsigned long nswap;
/*37 */ unsigned long cnswap;
/*38 */ int exit_signal;
/*39 */ int processor;
/*40 */ unsigned int rt_priority;
/*41 */ unsigned int policy;
/*42 */ unsigned long long delayacct_blkio_ticks;
/*TDB */
};

struct pid_track {
	struct list_head node;
	struct list_head child;
	struct pid_track *parent;
	int pid;
	int tid;
	int is_dummy; /* only account info for its children */
	int first_sample; /* first time to collect data for this @pt */
	struct taskstats pts[2];

	unsigned long long delta_io_delay_us, delta_mem_delay_us, delta_cpu_delay_us;
	unsigned long long delta_run;
	unsigned long delta_run_user, delta_run_sys;
	unsigned long long delta_context_switch, delta_involuntary_context_switch;
	unsigned long long delta_read_bytes, delta_write_bytes;
	float wait_rate;
	float csps; /* context switch per second: include voluntary and involuntary */
	float icsps; /* context switch per second: include voluntary and involuntary */
	float cpu_util, cpu_util_user, cpu_util_sys;
	float read_bps, write_bps;
	char cmdline[32]; /* only cut first 32 charactors */
	char comm[PR_SET_NAME];
};

enum {
	SORT_NONE,	/* -s nonde	: no sort */
